#include <stdio.h> // #~ : 전처리기(전처리 지시문), 프로그램 시작과 함께 가장 먼저 처리됨
// C의 기본 구조
int main(void) // 자료형/반환값의 형태	함수명(입력값의 형태)
{	// { 함수의 몸체 } 
	// 0과 1을 나타내는 최소 단위 : bit  2진수 10101010 -> 8bit
	// 8bit = 1byte, btye부터는 1024마다 단위가 올라감
	// 주석1
	int i = 0;	// 주석2		변수 i에 대한 부연설명

	/************************************************
	* [자료형]
	* 
	* * 정수
	* char  = 1byte - 128 ~ + 127 [1byte(0~127) 정수로 표기 가능한 문자 : ASCII 코드]
	* 문자형 x 문자를 표기하기 위해 만들어짐 
	* short = 2byte	- 32768 ~ + 32767
	* int   = 4byte 
	* long  = 4byte
	* 
	* * 실수
	* float		= 4byte
	* double	= 8byte
	*************************************************/

	//	연산자
	//	[+]	더하기
	//	[-]	빼기
	//	[*] 곱하기
	//	[/] 나누기
	//	[%] 나머지
	
	//	[=] 대입 연산자			연산 우선순위 최하위

	//	[.] 
	//	[,] 
	//	[:] 
	//	[;]						코드의 끝에 작성

	//	[''] 문자
	//	[""] 문자열

	//	단항연산의 표현
	//	[*] 애스터리스크		 자료형* A : 포인터
	//	[&] 엠퍼센트			 &A : 주소반환(반환값),		(입력값) 

	//	() 소괄호
	//	{} 중괄호
	//	[] 대괄호


	//	논리연산의 표현
	//	[&] AND
	//	[|] OR
	//	[^] XOR
	//	[!]	NOT			반전
	
	return 0;
}

